_wiki/2015-07-17-misc-in-general.html
---
collections: wiki
layout: post
title: Misc in General
date: 2015-07-17
categories: 
- misc
tags: 
-
author: carltonf
excerpt: misc knowledge
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Unicode</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">The Absolute Minimum Unicode Knowledge</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Every Software Developer Absolutely, Positively Must Know About Unicode and
Character Sets (No Excuses!)
</p>

<ul class="org-ul">
<li>the very first article that get me understand Unicode and Charset's basics.
</li>
</ul>
<p>
<a href="../core/7f/4c/unicode-minimal-knowledge/Unicode-abs.html">unicode-minimal-knowledge</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Software Architecture</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">event-based implicit invocation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="../core/bf/93/intro_to_implicit_invocation.pdf">intro<sub>to</sub><sub>implicit</sub><sub>invocation</sub>.pdf</a>
</p>
<ul class="org-ul">
<li>a clear styled intro with software architecture context
</li>
<li>an <b>very simple</b> article
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Free&amp;Open Source</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">short<sub>study</sub><sub>sustainable</sub><sub>open</sub><sub>source</sub><sub>project</sub><sub>(pgp4win)</sub></h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="../core/bd/b2/short_study_sustainable_open_source_project_(pgp4win)/ShortStudy-Sustainable-FS-example-Gpg4win.html">short<sub>study</sub><sub>sustainable</sub><sub>open</sub><sub>source</sub><sub>project</sub><sub>(pgp4win)</sub></a>
</p>

<ul class="org-ul">
<li>short and simple web article (<b>no</b> deep insight)
</li>
</ul>
</div>
<ul class="org-ul"><li><a id="sec-3-1-1" name="sec-3-1-1"></a>interesting parts:<br  /><div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>the pyramid structure of user space
</li>
<li>comparisons with other famous open source project like <span class="underline">Apache</span>
</li>
<li>plans and suggestions about the project's sustainability.
</li>
</ul>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Windows 7</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">A bug in Windows 7 Samba share</h3>
<div class="outline-text-3" id="text-4-1">
<p>
refer to this <a href="../core/c6/8c/smbmount_errors_in_win7.txt">smbmount<sub>errors</sub><sub>in</sub><sub>win7</sub>.txt</a> for patch.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Modern Working Environment</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><a href="../core/3b/91/Cubicle - Wikipedia, the free encyclopedia.maff">Cubicle - Wikipedia, the free encyclopedia</a></h3>
<div class="outline-text-3" id="text-5-1">
<p>
an article describe the most common modern working environment setup - cubicle.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">AOP</h2>
<div class="outline-text-2" id="text-6">
<p>
Wiki and another good articles introducing AOP. I haven't read every word of
these articles. Among them the most interesting parts are advices, which are
very useful to extend Emacs.
</p>

<p>
<a href="../core/0d/16/aspect-oriented-programming">aspect-oriented-programming</a>
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Peopleware</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="../core/ed/2c/peopleware_reading">peopleware<sub>reading</sub></a>
About how intelligence-intense work should be managed. Very enlightening.
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="todo TODO">TODO</span> Finish reading</h3>
</div>
</div>
